import Image from "next/image";
import Link from "next/link";
import { BsGenderFemale } from "react-icons/bs";
import { BsGenderMale } from "react-icons/bs";
export default function Home() {
  return (
    <div className="bg-white">
      <div className="bg-[url('/backimg.jpeg')] bg-cover object-cover w-full h-screen bg-center flex flex-col items-center justify-between">
        <div className="flex w-full px-5 py-[50px] flex-row items-center justify-between bg-gray-300">
          <div className="flex flex-row items-center gap-5">
            <Image src={"/xxa.jpg"} width={100} height={100} />
            <p className="text-black text-bold text-[20px]">
              Эрүүл мэндийн <br />
              хичээлийн бие даалт
            </p>
          </div>
          <div className="py-[20px] px-[20px] rounded-[8px] bg-slate-500 text-white hover:bg-slate-400 hover:text-blue-800">
            <Link href="/exercise"> Дасгал ажил</Link>
          </div>
        </div>
        <p className="text-white text-[60px] pb-[90px] text-bold">Бэлгийн хариу үйлдэл</p>
        <p></p>
      </div>
      <div className="w-full py-[150px] flex  flex-col justify-center items-center gap-[50px] bg-gradient-to-r from-pink-300 to-blue-300">
        <div>
          <p className="text-[50px] text-white font-serif text-center ">Бэлгийн хариу үйлдлийн тухай ойлголт</p>
        </div>
        <div className="flex flex-row">
          <div className="w-[20%] flex justify-center items-center">
            <BsGenderMale className="text-[200px] text-blue-400 " />
          </div>
          <div className="w-[60%] text-[20px] text-black  text-center">
            <p>
              Хүн үр удмаа үлдээхийн тулд төдийгүй дур таашаал авахын тулд бэлгийн харилцаанд ордог. Бэлгийн сэдээлтийн үед хүний бие махбод ямар
              хариу үйлдэл үзүүлдэг болохыг эрдэмтэд судлан хэд хэдэн загвар боловсруулсан байдаг. Америкийн судлаач Мастерс, Жонсон нар сэдээлтийг юу
              ч үүсгэсэн хүний бие махбодын хариу урвалын мөчлөг нь дараах дөрвөн үе шатаар явагддаг болохыг тодорхойлсон. Үүнд: сэрэл хөдлөх, суурь
              үе, дур ханах, бие тавирах. Бэлгийн сэдээлтийн үе дех хариу уйлдэл нь бие махбодын төдийгүй сэтгэл хөдлөлд гарах өөрчлөлтөөр илэрнэ.
              Бэлгийн дур хүслийг төрүүлж буй бүхий л зүйл нь бэлгийн сэдээлт юм. Ямар наг хэлбэрээр сэдээгдсэн ч бэлгийн мөрөөдөл, гар хангалга болон
              бусад бэлгийн хавьтлын ямар ч хэлбэрийн үед бэлгийн хариу үйлдэл дээрх үе шатаар явагдана. Бэлгийн хариу үйлдпийн үед илэрдэг
              физиологийн өөрчлөлтийн талаар мэдсэнээр өөрийгөө таньж мэдэхийн зэрэгцээ хосууд харилцан бие биеэ ойлгох, бэлгийн харилцаатай холбоотой
              ямар нэгэн асуудал бэрхшээл тулгарвал түүнийг хэрхэн даван туулах ойлголт нэмэгданэ. Бэлгийн хариу үйлдэл илрэх үе шат нь ерөнхий зүйл
              бөгөөд эдгээр үе шатны үргэлжлэх хугацаа болон илэрч буй байдал хүн бүрийн хувьд харилцан адилгүй байж болно. Эрэгтэй эмэгтэй хүний
              бэлгийн хариу үйлдэл эдгээр үе шатаар илрэх боловч онцлог ялгаатай.
            </p>
          </div>
          <div className="w-[20%] flex justify-center items-center ">
            <BsGenderFemale className="text-[200px] text-pink-400 " />
          </div>
        </div>
      </div>
      <div className="w-full h-screen bg-gradient-to-r from-gray-300 to-black flex items-center justify-center">
        <div className="w-[90%] h-[60%] rounded-[23px]  flex flex-row">
          <div className="w-[30%] h-[100%] bg-[url('/us.webp')] bg-cover rounded-l-[23px]"></div>
          <div className="w-[70%] h-[100%] p-[30px] flex flex-col  gap-[20px] py-[80px] bg-gradient-to-r from-[#5e5e5e] to-gray-300  rounded-r-[22px]">
            <p className="text-[35px]  leading-8  text-white font-serif pb-[20px]">Бэлгийн хариу үйлдлийн үе шат ба илрэх шинж тэмдэг</p>
            <p className="text-white  text-[20px]  leading-8">
              Бэлгийн хариу үйлдлийн үе шат бүрт эрэгтэй, эмэгтэй хунд дараах шинж тэмдгүүд илэрнэ.
            </p>
            <div>
              <p className="text-white text-[20px] ml-[40px] ">1.Сэрэл хөдлөх</p>
              <p className="text-white text-[20px] ml-[40px] ">2.Суурь үе</p>
              <p className="text-white text-[20px] ml-[40px] ">3.Дур ханах</p>
              <p className="text-white text-[20px] ml-[40px] ">4.Бие тавирах</p>
            </div>
          </div>
        </div>
      </div>
      <div className="w-full  flex flex-col items-center gap-[50px]  pb-[100px] pt-[100px]">
        <div className="w-[70%]  flex-col items-center  py-[30px] px-[30px] rounded-[20px] ml-[-300px]  border-[#ffac00] border-[2px] flex justidy-center">
          <p className="text-[#ffac00] text-[30px] font-serif pb-[20px]">Сэрэл хөдлөх</p>
          <p className="text-[20px] text-center">
            Бэлгийн дур хүсэл төрнө. Бэлэг эрхтэн цусаар дүүрч, шодой, хэлүү томордог. Сэрэл хөдлөх үе нь эрэгтэйд эмэгтэй хүнээс илүү хурдан
            явагддаг. Шодой хөвчрөхийн зэрэгцээ хуухнагийн арьс агшиж, хуухнаг дээш бие рүүгээ ойртон татагдана. Үрийн суваг ч агшиж төмсөг бие мөн
            бие рүү татагдана. Эмэгтэйчүүдэд үтрээ чийглэгдэнэ. Үтрээний шүүрэл ялгарна Хэлүү цусаар дүүрснээс хатуурч, хөвчирнө. Хөхний толгой болон
            нөсөөт хэсэг хатуурч томорно.
          </p>
        </div>
        <div className="w-[70%]  flex-col items-center  py-[30px] px-[30px] rounded-[20px] ml-[300px] border-[#ffac00] border-[2px] flex justidy-center">
          <p className="text-[#ffac00] text-[30px] font-serif pb-[20px]">Суурь үе</p>
          <p className="text-[20px] text-center">
            Энэ үед судас тэлэлт болон сэрэл хөдлөх үед илэрсэн өөрчлөлтүүд дээд хэмжээндээ хүрнэ. Шодой бүрэн хөвчирч, (шодой хатуурах, хөвчрөх нь
            хүн бурт харилцан адилгүй байж болно), хуухнаг бүрэн агшиж, төмсөг дээш татагддаг. Шээсний сүвээс бага зэрэг тунгалаг салсархаг шингэн
            ялгардаг нь куперийн булчирхайн шүүрэл юм. Энэ шүүрэл нь үрийн шингэн биш ч ганц нагон эр бэлгийн эс, ХДХВ агуулагдаж байх магадлалтай
            байдаг. Эмэгтэйчүүдэд "дур ханах суурь" үүснэ. Үтрээний үүдэвч талын хэсэг агшиж, салст нь хөөж хөвсийхийг "дур ханах суурь" гэж нэрлэдэг.
            Хэлүү агших, бэлгийн бага уруулын өнгө улам бараан болох шинж илэрнэ. Зурхний цохилт, цусны даралт нэмэгдэхийн зэрэгцээ амьсгалын тоо ч
            мэдэгдэхүйц олшрох нь эрэгтэй, эмэгтэй хүний аль алинд нь илэрнэ. Суурь үе нь сэрэл хөдлөх үеийн үргэлжлэл болж, дараагийн дур ханах үеийн
            бэлтгэл болох юм. Энэ үед судас тэлэх, булчин агших ээрэг нэмэгдсээр дур ханах физиологийн үндэс бүрдтэл үргэлжилдэг.
          </p>
        </div>
        <div className="w-[70%]  flex-col items-center  py-[30px] px-[30px] rounded-[20px] ml-[-300px] border-[#ffac00] border-[2px] flex justidy-center">
          <p className="text-[#ffac00] text-[30px] font-serif pb-[20px]">Дур ханах</p>
          <p className="text-[20px] text-center">
            Дур таашаалын оргил үе. Эрэгтэй, эмэгтэй хүмүүсийн аль алинд судасны цохилт, даралт болон амьсгалын тоо огцом олширдог. Бүх биеийн булчин
            огцом агшина, гар хөлийн булчингууд мөн агшина. Эрэгтэйчүүдэд дур тавих болон үрийн шингэн ялгаруулах нь зэрэг явагдана. Эмэгтэйчүүдэд дур
            ханах үе нь эрэгтэйчүүдээс илүү удаан байдаг. Эмэгтэйчүүд богино хугацаанд, дахин дахин дур ханах боломжтой. Зарим эмэгтэйчүүд дур
            ханалтын үед шингэн ялгаруулдаг. Эмэгтэйчуудийн ялгаруулсан шингэн нь шээсний сүвээр гардаг боловч энэ нь шээс биш.
          </p>
        </div>
        <div className="w-[70%]  flex-col items-center  py-[30px] px-[30px] rounded-[20px] ml-[300px] border-[#ffac00] border-[2px] flex justidy-center">
          <p className="text-[#ffac00] text-[30px] font-serif pb-[20px]">Бие тавирах</p>
          <p className="text-[20px] text-center">
            Дур ханасны дараа биеийн булчин суларч тавирдаг. Мөн цусаар дүүрсэн судасны цусан хангамж багассаар хэвийн байдалд ордог. Бие тавирах үe
            15-30 минут ургэлжилдэг. Гэхдээ дур ханалт явагдаагуй тохиолдолд илуу удаан үргэлжлэх боломжтой. Дийлэнх эрэгтэйчүүдэд бие тавирсны дараа
            амрах хэсэг хугацаа хэрэгтэй байдаг, үүнийг рефрактор үе гэж нэрлэдэг. Эна хугацааны дараа эрэгтэйчүүд дахин шодой хөвчирч дур тавих
            боломжтой болдог. Рефрактор үеийн үргэлжлах хугацаа эрэгтэйчуудийн хувьд харилцан адилгүй, зарим хунд хэдэн минут үргэлжилдэг бол зарим
            хүнд 24 цаг хуртал үргэлжилдэг. Залуу эрэгтэйд рефрактор үе бага байдаг бөгөөд шодой маш хурдан хөвчрөх боломжтой.
          </p>
        </div>
      </div>
      <div className="w-full py-[50px] h-screen  flex  flex-col  ">
        <div className="w-[100%] h-[100%] flex flex-row">
          <div className="w-[50%] h-[100%]   bg-[url('/lolzurag1.png')]  bg-center bg-cover"></div>
          <div className="w-[70%] h-[100%]  flex  justify-center ">
            <p className="text-[22px] pl-[50px]">
              Бэлгийн хариу үйлдлийн үе шатны дараалал болон үргэлжлэх хугацаа хүн тус бүрт харилцан адилгүй байна. Бэлгийн хариу үйлдлийн үе шат нь
              заавал тогтсон дарааллын дагуу байх албагүй. Тухайлбал, хүн бүр заавал дур ханах ёстой гэсэн үг биш. Түүнчлэн зөвхөн дур тавьсан
              тохиолдолд л бэлгийн таашаал авч, сэтгал ханамжтай байна гэсэн үг биш. Өөрөөр хэлбэл, дур ханаагүй байсан ч таашаал авч, сэтгэл
              ханамжтай байж болно.
            </p>
          </div>
        </div>
        <div className="w-[100%] h-[100%] flex items-center justify-center flex-row gap-5 pr-[50px]">
          <div className="w-[50%] h-[50%] ">
            <p className="text-[22px]">
              Эрэгтэй, эмэгтэй хүний бэлгийн хариу үйлдлийн давтамж хэрхэн ялгаатай болохыг 1 ба 2 дугаар зурагт харуулсан. Тус зургаас үзвэл Эмэгтэй
              хүн нэг удаагийн бэлгийн хавьтлын үед хэд хэдэн удаа дур ханах болмжтой . Харин эрэгтэй хүний хувьд нэг удаагийн бэлгийн хавьтлын үед
              дахин дур ханахын тулд түр амсхийх хугацаа хэрэгтэй .
            </p>
          </div>
          <div className="w-[50%] h-[100%]  bg-[url('/lolzurag2.png')]  bg-center bg-cover"></div>
        </div>
      </div>
      <div className="w-full py-[100px] flex justify-center">
        <div className="w-[70%] py-[50px] flex-col items-center   px-[30px] rounded-[20px] border-red-600 border-[2px] flex justidy-center">
          <p className="text-red-600 text-[30px] font-serif pb-[20px] text-center">Бэлгийн хариу үйлдэлд нөлөөлөх хүчин зүйлс ба дагавар</p>
          <p className="text-[20px] text-center">
            Бэлгийн хариу үйлдэлд эерэг болон сөргөөр нөлөөлдөг хүчин зүйл байдаг. Тухайлбал, хосуудын харилцаа, дотносол, сэтгэл санааны байдал, хорт
            зуршил, стресс, өвчин эмгэг, осол гэмтэл, хэрэглэж буй эм бэлдмэл гэх зэрэг олон зүйлс нөлөөлнө. Эдгээр хүчин зуйлсийн нөлөөгөөр бэлгийн
            дур хүсал төрөхгуй байх, сэрэл хөдлөхгүй байх, шодой хөвчрөхгүй байх, хэт хурдан дур ханах, эсвэл огт дур ханахгуй байх гэх зэрэг сөрөг үр
            дагавар гарна. Тиймээс дээрх сөргөөр нөлөөлөх хүчин зүйлсээс сэргийлэх нь чухал. Шаардлагатай тохиолдолд мэргеэлийн эмч, сэтгэл зүйчид
            хандаж, эмчилгээ хийлгэж зөвлөгөө авах хэрэгтэй.
          </p>
        </div>
      </div>
      <div className="w-full py-[100px] flex justify-center">
        <div className="w-[70%] h-auto  flex-col items-center  py-[30px] px-[30px] rounded-[20px] border-red-600 border-[2px] flex justidy-center">
          <p className="text-red-600 text-[30px] font-serif pb-[20px]">Дасгал ажил</p>
          <div className="text-[20px] ">
            <p>
              1.Америкийн судлаач Мастерс, Жонсон нар сэдээлтийн юуч үүсгэсэн хүний биеийн хариу урвалын мөчлөгийг ...... , ....... , ....... ,
              ........ гэж хуваасан
            </p>
            <p>2.Бэлгийн дур хүслийг түрүүлж буй бүхийл зүйл нь юу вэ ?</p>
            <p>3. Бие тавирах үе нь хэдий хугацаанд үргэлжилдэг вэ ?</p>
            <p>4. Дийлэнх эрэгтэйчүүд бие тавирсны дараа амрах хэсэг хугацаа хэрэгтэй байдаг . үүнийг ........ үe гэдэг.</p>
            <p>5. Бэлгийн хариу үйлдэлд эерэг болон сөргөөр нөлөөлдөг хүчин зүйлс нэрлээрэй.</p>
            <p>6. Бэлгийн хариу үйлдпийн сэрэл хөдлөх үе шатад эрэгтэй эмэгтэй 2 хүний альнд нь илүү хурдан явагддаг вэ ?</p>
            <p>7. Шээсний сүвээс бага зэрэг тунгалаг салсархаг шингэн ялгардаг нь .... шүүрэл юм.</p>
            <p>8. Бэлгийн хариу үйлдлийн дур ханах үе шатад эмэгтэйчүүд эрэгтэйчүүдийн аль нь илүү удаан явагддаг вэ ?</p>
            <p>9. Хүмүүс хоорондоо ямар ямар шалтгааны улмаас бэлгийн харилцаанд ордог вэ ?</p>
            <p>10. ....... нь сэрэл хөдлөх үеийн үргэлжлэл болж , дараагийн дур ханах үеийн бэлтгэл болдог.</p>
          </div>
        </div>
      </div>
      <div className="w-full h-[150px] bg-gray-300 flex items-center justify-center gap-[150px]">
        <div className="text-black">Өнөр цогцолбор сургууль 12е анги </div>
        <div className="text-black">
          © 2024 12е. <br /> All rights reserved. <br />
          Сурагч Д.Бат-Очир
        </div>
      </div>
    </div>
  );
}
